Repository: Christoph-D/Japanese-Tools
Catalog: gettext/po/*.po
Languages: de, pl

source: !ai is only available in channels.
de: !ai gibt es nur in Channels.
pl: !ai jest dostępne tylko na kanałach.

source: API error: Failed to connect to server: {}
de: API-Fehler: Verbindung zum Server fehlgeschlagen: {}

source: API error: Request timed out (%d seconds)
de: API-Fehler: Zeitüberschreitung (%d Sekunden)

source: API error: {}
de: API-Fehler: {}
pl: Błąd API: {}

source: Config file not found.
de: Konfigurationsdatei nicht gefunden.
pl: Nie znaleziono pliku konfiguracyjnego.

source: Failed to read response: {}
de: Konnte Antwort nicht lesen: {}
pl: Nie udało się odczytać odpowiedzi: {}

source: Flag -{} requires a value (e.g., -{}=1.0)
de: Option -{} benötigt einen Wert (z.B. -{}=1.0)
pl: Flaga -{} wymaga wartości (np. -{}=1.0)

source: HTTP client error: {}
de: HTTP-Client-Fehler: {}
pl: Błąd klienta HTTP: {}

source: Internal error: duplicate configured flags detected, check your model config
de: Interner Fehler: Doppelte Option, prüf die Modellkonfiguration
pl: Błąd wewnętrzny: wykryto zduplikowane skonfigurowane flagi, sprawdź konfigurację modelu

source: Invalid response: {}
de: Ungültige Antwort: {}
pl: Nieprawidłowa odpowiedź: {}

source: The current local time is {}.
de: Die aktuelle Lokalzeit ist {}.
pl: Aktualna lokalna godzina to {}.

source: The weather in {} is: {}.
de: Das Wetter in {} ist: {}.
pl: Pogoda w {} jest: {}.

source: Unknown flag: {}
de: Unbekanntes Flag: {}
pl: Nieznana flaga: {}

source: Usage: !ai [flags...] [command] <query>. Flags: -c (clear history), -t=<val> (temp), {} (select model). Commands: join <user...>, solo [user], joined, weather <city>, forecast <city>. Models: {}, Default: {} By default, history is split by user and deleted after {} minutes. The bot does not have access to a full chat log, it sees only your history.
de: Aufruf: !ai [Flags...] [Befehl] <Anfrage>. Flags: -c (Verlauf löschen), -t=<Wert> (Temperatur), {} (Modell wählen). Befehle: join <Nutzer...>, solo [Nutzer], joined, Wetter <Stadt>, Vorhersage <Stadt>. Modelle: {}, Standardmodell: {} Standardmäßig wird der Verlauf nach Nutzer getrennt und nach {} Minuten gelöscht. Der Bot hat keinen Zugriff auf den vollständigen Chat-Verlauf, sondern sieht nur deinen Verlauf.
pl: Sposób użycia: !ai [flagi...] [komenda] <zapytanie>. Flagi: -c (wyczyść historię), -t=<wartość> (temperatura), {} (wybierz model). Komendy: join <użytkownik...>, solo [użytkownik], joined, weather <miasto>, forecast <miasto>. Modele: {}, Domyślny: {} Domyślnie historia jest dzielona według użytkownika i usuwana po {} minutach. Bot nie ma dostępu do pełnego logu czatu, widzi tylko twoją historię.

source: Usage: !ai forecast <city> (Tell the AI this week's weather forecast. Weather data by https://open-meteo.com.)
de: Aufruf: !ai forecast <Stadt> (Teile der KI die Wettervorhersage dieser Woche mit. Wetterdaten von https://open-meteo.com.)
pl: Sposób użycia: !ai prognoza <miasto> (Przekaż AI prognozę pogody na ten tydzień. Dane pogodowe z https://open-meteo.com.)

source: Usage: !ai join <user...> (Join your chat history with other users' histories.)
de: Aufruf: !ai join <Nutzer...> (Verbinde deinen Chat-Verlauf mit dem anderer Nutzer.)
pl: Sposób użycia: !ai join <użytkownik...> (Połącz swoją historię czatu z historiami innych użytkowników.)

source: Usage: !ai joined (List the users with whom you share the chat history.)
de: Aufruf: !ai joined (Liste die Nutzer auf, mit denen du den Chat-Verlauf teilst.)
pl: Sposób użycia: !ai joined (Wyświetl użytkowników, z którymi współdzielisz historię czatu.)

source: Usage: !ai solo [user] (Disable the shared history for yourself or the given user.)
de: Aufruf: !ai solo [Nutzer] (Deaktiviere den geteilten Verlauf für dich oder den angegebenen Nutzer.)
pl: Sposób użycia: !ai solo [użytkownik] (Wyłącz współdzieloną historię dla siebie lub podanego użytkownika.)

source: Usage: !ai weather <city> (Tell the AI the current weather. Weather data by https://open-meteo.com.)
de: Aufruf: !ai weather <Stadt> (Teile der KI das aktuelle Wetter mit. Wetterdaten von https://open-meteo.com.)
pl: Sposób użycia: !ai pogoda <miasto> (Przekaż AI aktualną pogodę. Dane pogodowe z https://open-meteo.com.)

source: Weather API error: {}
de: Wetter-API-Fehler: {}
pl: Błąd API pogody: {}

source: Weather forecast for {}: {}.
de: Wettervorhersage für {}: {}.
pl: Prognoza pogody dla {}: {}.

source: forecast
de: Vorhersage
pl: prognoza

source: weather
de: Wetter
pl: pogoda

source: {} is not sharing memory with anyone.
de: {} teilt seinen Speicher nicht.
pl: {} nie współdzieli pamięci z nikim.

source: {} is now solo.
de: {} teilt seinen Speicher nicht mehr.
pl: {} jest teraz samodzielny.

source: {} is sharing memory with: {}
de: {} teilt seinen Speicher mit: {}
pl: {} współdzieli pamięć z: {}

source: {} joined memory with the group: {}
de: {} teilt jetzt seinen Speicher mit: {}
pl: {} dołączył do pamięci grupy: {}

source: Default model not found
de: Standardmodell nicht gefunden
pl: Nie znaleziono domyślnego modelu

source: Missing API keys or model configuration
de: Fehlende API keys oder Modellkonfiguration
pl: Brak kluczy API lub konfiguracji modelu

source: Clear sky
de: Klarer Himmel
pl: Czyste niebo

source: Dense drizzle
de: Dichter Nieselregen
pl: Gęsta mżawka

source: Dense freezing drizzle
de: Dichter gefrierender Nieselregen
pl: Gęsta marznąca mżawka

source: Depositing rime fog
de: Rauhreifnebel
pl: Mgła szadziowa

source: Failed to parse geocoding response: {}
de: Konnte Geocoding-Antwort nicht lesen: {}
pl: Nie udało się przeanalizować odpowiedzi geokodowania: {}

source: Failed to parse weather API response: {}
de: Konnte Wetter-API-Antwort nicht lesen: {}
pl: Nie udało się przeanalizować odpowiedzi API pogody: {}

source: Fog
de: Nebel
pl: Mgła

source: Forecast is unavailable.
de: Wettervorhersage nicht gefunden.
pl: Prognoza pogody jest niedostępna.

source: Geocoding API error: HTTP {}
de: Geocoding-API-Fehler: HTTP {}
pl: Błąd API geokodowania: HTTP {}

source: Geocoding API error: {}
de: Geocoding-API-Fehler: {}
pl: Błąd API geokodowania: {}

source: Heavy freezing rain
de: Starker gefrierender Regen
pl: Silny marznący deszcz

source: Heavy rain
de: Starker Regen
pl: Silny deszcz

source: Heavy snow fall
de: Starker Schneefall
pl: Silny opad śniegu

source: Heavy snow showers
de: Starke Schneeschauer
pl: Silne przelotne opady śniegu

source: Inform the user about this weather API error in a friendly way.
de: Informiere den Benutzer freundlich über diesen Wetter-API-Fehler.

source: Light drizzle
de: Leichter Nieselregen
pl: Lekka mżawka

source: Light freezing drizzle
de: Leichter gefrierender Nieselregen
pl: Lekka marznąca mżawka

source: Light freezing rain
de: Leichter gefrierender Regen
pl: Lekki marznący deszcz

source: Mainly clear
de: Meist klar
pl: Przeważnie bezchmurnie

source: Moderate drizzle
de: Mäßiger Nieselregen
pl: Umiarkowana mżawka

source: Moderate rain
de: Mäßiger Regen
pl: Umiarkowany deszcz

source: Moderate rain showers
de: Mäßige Regenschauer
pl: Umiarkowane przelotne opady deszczu

source: Moderate snow fall
de: Mäßiger Schneefall
pl: Umiarkowany opad śniegu

source: Overcast
de: Bedeckt
pl: Pochmurno

source: Partly cloudy
de: Teilweise bewölkt
pl: Częściowe zachmurzenie

source: Slight rain
de: Leichter Regen
pl: Lekki deszcz

source: Slight rain showers
de: Leichte Regenschauer
pl: Lekkie przelotne opady deszczu

source: Slight snow fall
de: Leichter Schneefall
pl: Lekki opad śniegu

source: Slight snow showers
de: Leichte Schneeschauer
pl: Lekkie przelotne opady śniegu

source: Snow grains
de: Schneegriesel
pl: Śnieg ziarnisty

source: Thunderstorm
de: Gewitter
pl: Burza

source: Thunderstorm with heavy hail
de: Gewitter mit starkem Hagel
pl: Burza z silnym gradobiciem

source: Thunderstorm with slight hail
de: Gewitter mit leichtem Hagel
pl: Burza z lekkim gradobiciem

source: Unknown location: {}
de: Unbekannter Ort: {}
pl: Nieznana lokalizacja: {}

source: Unknown weather condition
de: Unbekannte Wetterbedingung
pl: Nieznany stan pogody

source: Violent rain showers
de: Heftige Regenschauer
pl: Gwałtowne przelotne opady deszczu

source: Weather API error: HTTP {}
de: Wetter-API-Fehler: HTTP {}
pl: Błąd API pogody: HTTP {}

source: {}, Temperature: {}°C, Cloud cover: {}%, Wind: {}km/h, Humidity: {}%, Precipitation: {}mm
de: {}, Temperatur: {}°C, Bewölkung: {}%, Wind: {}km/h, Luftfeuchtigkeit: {}%, Niederschlag: {}mm
pl: {}, Temperatura: {}°C, Zachmurzenie: {}%, Wiatr: {}km/h, Wilgotność: {}%, Opady: {}mm

source: {}: {}, night: {}°C, day: {}°C, precipitation: {}mm
de: {}: {}, Nacht: {}°C, Tag: {}°C, Niederschlag: {}mm
pl: {}: {}, noc: {}°C, dzień: {}°C, opady: {}mm

source: A very simple bot with 日本語 support: https://github.com/Christoph-D/Japanese-Tools/
de: Ein sehr einfacher Bot mit 日本語-Features: https://github.com/Christoph-D/Japanese-Tools/

source: An error occurred.
de: Ein Fehler ist aufgetreten.
pl: Wystąpił błąd.

source: Known commands:
de: Bekannte Befehle:
pl: Znane komendy:

source: Audio for %s: %s
de: Audio für %s: %s
pl: Audio dla %s: %s

source: No audio file available for %s.
de: Keine Audio-Datei gefunden für %s.
pl: Brak plików audio dla %s.

source: No audio file available.
de: Keine Audio-Datei gefunden.
pl: Brak plików audio.

source: Please provide a word.
de: Bitte ein Wort angeben.
pl: Proszę wpisać jakieś słowo.

source: Usage: %s word [reading]
de: Aufruf: %s Wort [Lesung]
pl: Sposób użycia: %s słowo [pisownia]

source: Usage: !%s [explain|declare] <something>
de: Aufruf: !%s [explain|declare] <irgendwas>
pl: Sposób użycia: !%s [explain|declare] <coś>

source: Article not found on Wikipedia.
de: Wikipedia-Artikel nicht gefunden.
pl: Nic nie znaleziono.

source: It's a tie.
de: Unentschieden.
pl: Remis.

source: UTF-16 wins by %s.
de: UTF-16 gewinnt mit %s Vorsprung.
pl: UTF-16 wygrywa o %s.

source: UTF-8 wins by %s.
de: UTF-8 gewinnt mit %s Vorsprung.
pl: UTF-8 wygrywa o %s.

source: Usage: %s lemma
de: Aufruf: %s Lemma
pl: Sposób użycia: %s test

source: Could not find the dictionary.
de: Konnte das Wörterbuch nicht finden.
pl: Nie można znaleźć słownika.

source: Please call jm.sh or wa.sh instead.
de: Bitte jm.sh oder wa.sh aufrufen.
pl: Proszę użyj jm.sh albo wa.sh

source: Too little space to show the result.
de: Zu wenig Platz, um das Ergebnis anzuzeigen.
pl: Brak miejsca aby wyświetlić wynik.

source: Unknown word.
de: Unbekanntes Wort.
pl: Nieznane słowo.

source: Please run: source_dict=<source> ./ja.sh
de: Aufruf: source_dict=<source> ./ja.sh
pl: Proszę użyć: source_dict=<źródło> ./ja.sh

source: Please run: %s
de: Bitte führe den folgenden Befehl aus: %s
pl: Uruchom: %s

source: Correct: %s of %s, Corrections:%s.
de: Korrekt: %s von %s, Korrekturen:%s.
pl: Poprawnych: %s z %s, Poprawek:%s.

source: Could not create directory %s. Please fix %s.
de: Konnte Verzeichnis %s nicht erstellen. Bitte %s reparieren.
pl: Nie można utworzyć folderu %s. Napraw %s.

source: Could not determine channel name or query sender. Please fix %s.
de: Konnte Channel-Namen bzw. Query-Sender nicht ermitteln. Bitte %s reparieren.
pl: Nie można ustalić nazwy kanału lub nadawcy wiadomości. Napraw %s.

source: Could not determine nick name. Please fix %s.
de: Konnte Nickname nicht ermitteln. Bitte %s reparieren.
pl: Nie można ustalić nicka. Napraw %s.

source: No diff available. :-(
de: Kein Diff verfügbar. :-(
pl: Diff niedostępny. :-(

source: No statistics available for %s.
de: Keine Statistik für %s vorhanden.
pl: Brak statystyk dla %s.

source: Perfect! %s of %s.
de: Alles korrekt! %s von %s.
pl: Doskonale! %s z %s.

source: Please don't call this script directly, use %s or %s instead.
de: Dieses Skript bitte nicht direkt ausführen, stattdessen %s oder %s benutzen.
pl: Proszę nie używać tego skryptu bezpośrednio, użyj %s albo %s.

source: Please fix %s.
de: Bitte repariere %s.
pl: Napraw %s.

source: Please write in romaji: %s
de: Leseübung: %s
pl: Napisz to w romaji: %s

source: Start with "%s <level> [count]". Known levels are 0 to %s. To learn more about a level please use "%s help <level>". To only see the differences between consecutive levels, please use "%s helpdiff <level>".
de: Beginnen mit "%s <Stufe> [Anzahl]". Bekannte Stufen sind 0 bis %s. Für Erklärung einer Stufe bitte "%s help <Stufe>" eingeben. Um nur die neuen Zeichen einer Stufe anzuzeigen bitte "%s helpdiff <Stufe>" verwenden.
pl: Rozpocznij z "%s <poziom> [ilość]". Znane są poziomy od 0 do %s. Aby dowiedzieć się więcej o poziomach wpisz "%s help <poziom>". Aby zobaczć rożnice pomiedzy poszczególnymi poziomami, wpisz "%s helpdiff <poziom>".

source: Statistics for %s: %s%% of %s characters correct.
de: Statistik für %s: %s%% von %s Zeichen korrekt.
pl: Statystyki dla %s: %s%% z %s poprawnych znaków.

source: Unfortunately, no character was right. Solution:%s.
de: Leider kein einziges Zeichen korrekt. Lösung:%s.
pl: Niestety, żaden ze znaków nie był poprawny. Rozwiązanie:%s

source: %s: %s stroke. %s {%s}
de: %s: %s Strich. %s {%s}
pl: %s: %s kreska. %s {%s}

source: . In names:
de: . In Eigennamen:
pl: . W nazwach:

source: No kanji found.
de: Keine Kanji gefunden.
pl: Nie znaleziono kanji

source: No regular expressions, please.
de: Bitte keine regulären Ausdrücke.
pl: Bez wyrażeń regularnych proszę.

source: Please enter some kanji.
de: Bitte ein paar Kanji angeben.
pl: Wpisz jakieś kanji.

source: %s: Correct! (%s: %s)
de: %s: Richtig! (%s: %s)
pl: %s: Poprawnie! (%s: %s)

source: %s: Sadly, no.
de: %s: Leider nein.
pl: %s: Niestety nie.

source: In the last 2 months, %s answered %s/%s (%s%%) questions correctly and skipped %s/%s (%s%%).
de: In den letzten 2 Monaten hat %s %s/%s (%s%%) Fragen korrekt beantwortet und %s/%s (%s%%) übersprungen.
pl: Przez ostatnie 2 miesiące, %s odpowiedział poprawnie na %s/%s (%s%%) pytań i pominął %s/%s (%s%%).

source: Nothing to skip!
de: Nichts zu überspringen!
pl: Nie ma nic do pominięcia!

source: Please choose [1-4]: %s (1: %s 2: %s 3: %s 4: %s).
de: Bitte wähle [1-4]: %s (1: %s 2: %s 3: %s 4: %s).
pl: Proszę wybrać [1-4]: %s (1: %s 2: %s 3: %s 4: %s).

source: Please specify a level.
de: Bitte ein Level angeben.
pl: Proszę wybrać poziom.

source: Skipping... (%s: %s)
de: Überspringe... (%s: %s)
pl: Pomijanie... (%s: %s)

source: Statistics can be accessed by "%s stats <nickname>".
de: Statistiken können mit "%s stats <nickname>" betrachtet werden.
pl: Statystyki można zobaczyć poprzez "%s stats <nick>".

source: Try "%s skm2". With "%s skip" you can skip questions.
de: Beispiel: "%s skm2". Mit "%s skip" kannst du Fragen überspringen.
pl: Spróbuj "%s skm2". Używając "%s skip" możesz pomijać pytania.

source: Unknown level "%s". Valid levels (number of questions): %s
de: Unbekanntes Level "%s". Gültige Levels sind (Zahl der Fragen): %s
pl: Nieznany poziom "%s". Poprawne poziomy (liczba pytań): %s

source: Unknown user: %s
de: Unbekannter Nutzer: %s
pl: Nieznany użytkownik: %s

source: Usage: %s stats <nickname>
de: Benutzung: %s stats <nickname>
pl: Sposób użycia: %s stats <nick>

source: Couldn't find firejail. Please install firejail.
de: firejail nicht gefunden. Bitte installiere firejail.
pl: Nie znaleziono firejail. Proszę zainstalować firejail.

source: Couldn't find mueval. Please run install_mueval.sh from the project root.
de: mueval nicht gefunden. Führe install_mueval.sh vom Projektverzeichnis aus.
pl: Nie znaleziono mueval. Proszę uruchomić install_mueval.sh z katalogu głównego projektu.

source: Example: !calc 1+1
de: Beispiel: !calc 1+1
pl: Przykład: !calc 1+1

source: Memory limit exceeded.
de: Speicherlimit überschritten.
pl: Przekroczono limit pamięci.

source: Please don't call this script directly.
de: Dieses Skript bitte nicht direkt ausführen.
pl: Proszę nie używać tego skryptu bezpośrednio.

source: Time limit exceeded.
de: Zeitlimit überschritten.
pl: Przekroczono limit czasu.

source: Hardest words for %s (#mistakes/#skipped): %s
de: Schwierigste Wörter für %s (#Fehler/#übersprungen): %s
pl: Najtrudniejsze słowa dla %s (błędów/pominięć): %s

source: Please read: %s
de: Bitte lies: %s
pl: Przeczytaj: %s.

source: Skipping %s (%s: %s)
de: Überspringe %s (%s: %s)
pl: Pomijanie %s (%s: %s)

source: Try "%s jlpt4". With "%s skip" you can skip questions.
de: Beispiel: "%s jlpt4". Mit "%s skip" kannst du Fragen überspringen.
pl: Spróbuj "%s jlpt4". Używając "%s skip" możesz pomijać pytania.

source: Unknown level "%s". Valid levels (number of words): %s
de: Unbekanntes Level "%s". Gültige Levels sind (Zahl der Wörter): %s
pl: Nieznany poziom "%s". Poprawne poziomy (liczba słów): %s

source: No result.
de: Kein Ergebnis.
pl: Brak wyników

source: Please put "rtk.txt" in the same directory as this script.
de: Bitte "rtk.txt" in dasselbe Verzeichnis wie dieses Skript legen.
pl: Umieść "rtk.txt" w tym samym folderze co skrypt.

source: Unknown kanji number.
de: Unbekannte Kanji-Nummer.
pl: Nieznany numer kanji

source: Unknown keyword.
de: Unbekanntes Keyword.
pl: Nieznane słowo

source: UTF-8 vs. UTF-16: %d vs. %d bytes.
pl: UTF-8 vs. UTF-16: %d vs. %d bajtów.

source: A very simple bot with 日本語 support.
pl: Bardzo prosty bot z obsługą 日本語
